class book:
    def __init__(self,name,type,back,overview):
        self.name = name
        self.type = type
        self.back = back
        self.overview = overview

bookIdMap = dict({1:book("被裁了，我只想安安静静卖个烤红薯，咋就...",
                         "现代都市",
                         "现代都市","""
                                                 主角林阳是个理工男，经济不景气被裁员了，找了几个月也找不到工作，只能去卖烤红薯,天天被城管欺负；
                                                 意外之下获得了中医和传统武术传承，自此开启了他的开挂人生，富豪权贵挨个找他看病，四大美女被他倾倒；
                                                 林阳感叹：我只想安安静静卖个烤红薯，咋就...
                                                  """)})
# 调用
# gen_novel_outline.gen_novel_outline("outline","传统武术和中医在现在社会被大家不认可，甚至被大家认为是骗人的；","主角是个靠喷传统武术和中医博取流量的底层人物；"
#                                                                                                              "后来巧合下主角传承了中医和传统武术；"
#                                                                                                              "主角慢慢走向人生巅峰，让拜金前女主被疯狂打脸；"
#                                                                                                              "反派势力从古代延续至今，一直接受的传承就是要灭绝中医和传统武术；"
#                                                                                                              "只有彻底断绝，反派才能释放被封印的邪恶力量，进而统治世界；"
#                                                                                                              "主角被迫卷进了这场延续至今的斗争...；")

# 我被裁员了，我只想安安静静卖个烤红薯，结果...
# gen_novel_outline.gen_novel_outline("现代都市","现代都市","""
#                                                                     主角林阳是个理工男，经济不景气被裁员了，找了几个月也找不到工作，只能去卖烤红薯,天天被城管欺负；
#                                                                     意外之下获得了中医和传统武术传承，自此开启了他的开挂人生，富豪权贵挨个找他看病，四大美女被他倾倒；
#                                                                     林阳感叹：我只想安安静静卖个烤红薯，咋就...
#                                                                      """)
book = bookIdMap[1]

